###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID eda-2.EECS.Berkeley.EDU)
#  Generated on:      Thu Apr 25 20:18:39 2024
#  Design:            data_recovery
#  Command:           write_db data_recovery_FINAL -def -verilog
###############################################################
current_design data_recovery
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clock_0}]  -name clock_0 -period 4.160000 -waveform {0.000000 2.080000}
create_clock [get_ports {clock_480}]  -name clock_480 -period 2.080000 -waveform {0.000000 1.040000}
create_generated_clock -name clock_1 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {0.416 0.416 0.416} [get_ports {clock_1}]
create_generated_clock -name clock_2 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {0.832 0.832 0.832} [get_ports {clock_2}]
create_generated_clock -name clock_3 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {1.248 1.248 1.248} [get_ports {clock_3}]
create_generated_clock -name clock_4 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {1.664 1.664 1.664} [get_ports {clock_4}]
create_generated_clock -name clock_5 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {2.08 2.08 2.08} [get_ports {clock_5}]
create_generated_clock -name clock_6 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {2.496 2.496 2.496} [get_ports {clock_6}]
create_generated_clock -name clock_7 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {2.912 2.912 2.912} [get_ports {clock_7}]
create_generated_clock -name clock_8 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {3.328 3.328 3.328} [get_ports {clock_8}]
create_generated_clock -name clock_9 -source [get_ports {clock_0}] -edges {1 2 3} -edge_shift {3.744 3.744 3.744} [get_ports {clock_9}]
set_load -pin_load -max  1  [get_ports {data_out}]
set_load -pin_load -min  1  [get_ports {data_out}]
set_clock_uncertainty 0.001 [get_clocks {clock_3}]
set_clock_uncertainty 0.001 [get_clocks {clock_4}]
set_clock_uncertainty 0.001 [get_clocks {clock_5}]
set_clock_uncertainty 0.001 [get_clocks {clock_6}]
set_clock_uncertainty 0.001 [get_clocks {clock_0}]
set_clock_uncertainty 0.001 [get_clocks {clock_480}]
set_clock_uncertainty 0.001 [get_clocks {clock_7}]
set_clock_uncertainty 0.001 [get_clocks {clock_1}]
set_clock_uncertainty 0.001 [get_clocks {clock_8}]
set_clock_uncertainty 0.001 [get_clocks {clock_2}]
set_clock_uncertainty 0.001 [get_clocks {clock_9}]
set_clock_groups -name __default_4 -asynchronous  -allow_paths  -group  [get_clocks {clock_8 clock_7 clock_6 clock_5 clock_4 clock_3 clock_2 clock_1 clock_0 clock_9}]
set_clock_groups -name __default_3 -asynchronous  -allow_paths  -group  [get_clocks {clock_480}]
